test/fixtures/stripe/subscription-canceled.json

{
  "id": "sub_1T2SsEDEGraYraOk6QdGfzvj",
  "object": "subscription",
  "application": null,
  "application_fee_percent": null,
  "automatic_tax": {
    "disabled_reason": null,
    "enabled": false,
    "liability": null
  },
  "billing_cycle_anchor": 1771490774,
  "billing_cycle_anchor_config": null,
  "billing_mode": {
    "flexible": null,
    "type": "classic"
  },
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": 1771490778,
  "cancellation_details": {
    "comment": null,
    "feedback": null,
    "reason": "cancellation_requested"
  },
  "collection_method": "charge_automatically",
  "created": 1771490774,
  "currency": "usd",
  "customer": "cus_U0TpvrT6VjrQQC",
  "customer_account": null,
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discounts": [],
  "ended_at": 1771490778,
  "invoice_settings": {
    "account_tax_ids": null,
    "issuer": {
      "type": "self"
    }
  },
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_U0TpJN0D7TmMxw",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1771490774,
        "current_period_end": 1773909974,
        "current_period_start": 1771490774,
        "discounts": [],
        "metadata": {},
        "plan": {
          "id": "price_1T2SsEDEGraYraOkUDA5v4xo",
          "object": "plan",
          "active": true,
          "amount": 1500,
          "amount_decimal": "1500",
          "billing_scheme": "per_unit",
          "created": 1771490774,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "meter": null,
          "nickname": null,
          "product": "prod_U0TpeTyFoNvPuf",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1T2SsEDEGraYraOkUDA5v4xo",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1771490774,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_U0TpeTyFoNvPuf",
          "recurring": {
            "interval": "month",
            "interval_count": 1,
            "meter": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 1500,
          "unit_amount_decimal": "1500"
        },
        "quantity": 1,
        "subscription": "sub_1T2SsEDEGraYraOk6QdGfzvj",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_1T2SsEDEGraYraOk6QdGfzvj"
  },
  "latest_invoice": "in_1T2SsEDEGraYraOkXXfDCnRe",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "on_behalf_of": null,
  "pause_collection": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null,
    "save_default_payment_method": "off"
  },
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "id": "price_1T2SsEDEGraYraOkUDA5v4xo",
    "object": "plan",
    "active": true,
    "amount": 1500,
    "amount_decimal": "1500",
    "billing_scheme": "per_unit",
    "created": 1771490774,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "meter": null,
    "nickname": null,
    "product": "prod_U0TpeTyFoNvPuf",
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start_date": 1771490774,
  "status": "canceled",
  "test_clock": null,
  "transfer_data": null,
  "trial_end": null,
  "trial_settings": {
    "end_behavior": {
      "missing_payment_method": "create_invoice"
    }
  },
  "trial_start": null
}
