test/fixtures/stripe/subscription-trialing.json

{
  "id": "sub_1T2Sv0DEGraYraOkYSU3tfYm",
  "object": "subscription",
  "application": null,
  "application_fee_percent": null,
  "automatic_tax": {
    "disabled_reason": null,
    "enabled": false,
    "liability": null
  },
  "billing_cycle_anchor": 1771577346,
  "billing_cycle_anchor_config": null,
  "billing_mode": {
    "flexible": null,
    "type": "classic"
  },
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "cancellation_details": {
    "comment": null,
    "feedback": null,
    "reason": null
  },
  "collection_method": "charge_automatically",
  "created": 1771490946,
  "currency": "usd",
  "customer": "cus_U0Ts6oZ7oPlNan",
  "customer_account": null,
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discounts": [],
  "ended_at": null,
  "invoice_settings": {
    "account_tax_ids": null,
    "issuer": {
      "type": "self"
    }
  },
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_U0Tsz1kj4mzWg5",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1771490946,
        "current_period_end": 1771577346,
        "current_period_start": 1771490946,
        "discounts": [],
        "metadata": {},
        "plan": {
          "id": "price_1T2SuzDEGraYraOkQxPibfiV",
          "object": "plan",
          "active": true,
          "amount": 1500,
          "amount_decimal": "1500",
          "billing_scheme": "per_unit",
          "created": 1771490945,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "meter": null,
          "nickname": null,
          "product": "prod_U0TsJBVgyOkInl",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1T2SuzDEGraYraOkQxPibfiV",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1771490945,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_U0TsJBVgyOkInl",
          "recurring": {
            "interval": "month",
            "interval_count": 1,
            "meter": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 1500,
          "unit_amount_decimal": "1500"
        },
        "quantity": 1,
        "subscription": "sub_1T2Sv0DEGraYraOkYSU3tfYm",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_1T2Sv0DEGraYraOkYSU3tfYm"
  },
  "latest_invoice": "in_1T2Sv0DEGraYraOkRi6kQMI5",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "on_behalf_of": null,
  "pause_collection": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null,
    "save_default_payment_method": "off"
  },
  "pending_invoice_item_interval": null,
  "pending_setup_intent": "seti_1T2Sv1DEGraYraOkqUY8NXFI",
  "pending_update": null,
  "plan": {
    "id": "price_1T2SuzDEGraYraOkQxPibfiV",
    "object": "plan",
    "active": true,
    "amount": 1500,
    "amount_decimal": "1500",
    "billing_scheme": "per_unit",
    "created": 1771490945,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "meter": null,
    "nickname": null,
    "product": "prod_U0TsJBVgyOkInl",
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start_date": 1771490946,
  "status": "trialing",
  "test_clock": null,
  "transfer_data": null,
  "trial_end": 1771577346,
  "trial_settings": {
    "end_behavior": {
      "missing_payment_method": "create_invoice"
    }
  },
  "trial_start": 1771490946
}
